# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'mackup'
brew 'tree' # List directories in a tree structure
brew 'htop' # process monitor
brew 'bash-completion' # bash completion 
brew 'tldr' # man pages 
brew 'jq' # json parser command line tool
brew 'svn'
brew 'zsh' 
brew 'antigen' # oh-my-zsh plugin to ease other plugins installation
brew 'zsh-syntax-highlighting' 
brew 'zsh-autosuggestions' 
brew 'zsh-history-substring-search'
 

# Development
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'terraform'
brew 'kubernetes-cli'
brew 'kubectl'
brew 'npm'
brew 'node'
brew 'nvm'
brew 'maven'
brew 'gradle'
brew 'docker-compose'
brew 'mvnvm'

# Apps
cask 'firefox'
cask 'github'
cask 'pastebot'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'intellij-idea'
cask 'iterm2'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

